"""
@version: ??
@author: coco wang
@license: Apache Licence 
@contact: endoffight@gmail.com
@site: 
@software: PyCharm
@file: D1.py
@time: 2017/12/26 0026 下午 9:08
"""

"""
我本来不是科班出身，因为工作上的接触和时代的发展以及个人兴趣，一直想接触人工智能，机器学习，数据挖掘等门外汉听起来高大上的领域，苦于不知从何下手，然后就在网上查资料，看网页，胡乱查阅，忽然柳暗花明又一村，看见了自己之前做的皮毛的东西原来属于自然语言处理这个大学科（NLP），接下来大家肯定就知道了，查找自然语言处理是什么，能干什么，分哪些方向呢，咦，发现真是博大精深，而且应用广泛，贴合人类生活，嗯，没错，这个就是我所要的，可以为之努力啦。
这里第一天参阅的博文链接：
自然语言处理扫盲·第一天——自然语言处理的背景、应用、推荐资料
好了，前言一推废话，正题是找到了一本非常好的书籍《Python自然语言处理中文版》，他是陈涛免费翻译的，原版是《Natural Language Processing with Python》，后面就一起来啃这本书吧。

http: // www.cnblogs.com / xing901022 / p / 7482328.
html

请大家在网上搜一下博主的系列文章：自然语言处理扫盲·第一天——自然语言处理的背景、应用、推荐资料
"""
